"""class Time with fields hours, minutes
method:
    Вычитание переменной типа Time (учесть, что возможен переход в
    предыдущие сутки). Результат должен быть типа Time.

Операции приведения типа:
    int – результатом является количество минут (время переводится в минуты);
    boolean – результатом является true, если часы и минуты не равны нулю,
        и false в противном случае.

Бинарные операции:
    < Time t – время переводится в минуты, результатом является true, если количество
        минут в левом операнде меньше, чем количество минут в правом операнде,
        и false – в противном случае.
    > Time t — время переводится в минуты, результатом является true, если количество
        минут в левом операнде больше, чем количество минут в правом операнде,
        и false – в противном случае."""
